{
    "posts": [
      {
        "id": 1,
        "category": "math",
        "author": "محمد أحمد",
        "title": "المعادلات التفاضلية",
        "content": "هل يمكن لأحد أن يشرح لي كيفية حل المعادلات التفاضلية من الدرجة الثانية؟",
        "comments": [
          {
            "author": "علي محمود",
            "content": "يمكنك استخدام طريقة تغيير المتغيرات للتبسيط ثم إيجاد الحل العام."
          },
          {
            "author": "سارة خالد",
            "content": "أنصحك بالبدء بدراسة الحالات الخاصة أولاً ثم الانتقال إلى الحالة العامة. هناك عدة طرق منها طريقة التخمين وطريقة المعاملات غير المحددة."
          }
        ]
      },
      {
        "id": 2,
        "category": "math",
        "author": "فاطمة علي",
        "title": "نظرية الاحتمالات",
        "content": "ما هو الفرق بين التوزيع الطبيعي والتوزيع ثنائي الحد؟ وكيف يمكن تطبيقهما في الإحصاء؟",
        "comments": [
          {
            "author": "عمر سعيد",
            "content": "التوزيع الطبيعي متصل بينما التوزيع ثنائي الحد منفصل. يستخدم التوزيع الطبيعي عندما يكون لديك عينة كبيرة وتريد التعميم."
          },
          {
            "author": "نورا محمد",
            "content": "التوزيع ثنائي الحد يكون مناسباً عندما تتعامل مع تجارب لها نتيجتان فقط (نجاح/فشل) بينما التوزيع الطبيعي أكثر شيوعاً في الظواهر الطبيعية."
          }
        ]
      },
      {
        "id": 3,
        "category": "programming",
        "author": "أحمد خالد",
        "title": "تعلم JavaScript",
        "content": "ما هي أفضل الموارد لتعلم JavaScript للمبتدئين؟ وهل من الضروري تعلم HTML وCSS قبلها؟",
        "comments": [
          {
            "author": "زياد عمر",
            "content": "نعم، من الأفضل تعلم HTML وCSS أولاً لأنهم يشكلون الأساس للتفاعل مع DOM. أنصحك بموقع MDN ومنصة freeCodeCamp للتعلم."
          },
          {
            "author": "ليلى سمير",
            "content": "أوصي بكتاب 'Eloquent JavaScript' وكذلك دورات JavaScript على Udemy. من المهم أن تبدأ في بناء مشاريع صغيرة أثناء التعلم."
          }
        ]
      },
      {
        "id": 4,
        "category": "programming",
        "author": "محمود سامي",
        "title": "مقارنة بين React و Vue",
        "content": "أنا مطور واجهات أمامية مبتدئ وأرغب في تعلم إطار عمل JavaScript. هل تنصحون بـ React أم Vue للبدء؟",
        "comments": [
          {
            "author": "كريم فادي",
            "content": "أنصح بـ Vue للمبتدئين لأن منحنى التعلم أسهل وتوثيقه ممتاز، لكن React لديه مجتمع أكبر وفرص عمل أكثر."
          },
          {
            "author": "سلمى رامي",
            "content": "اعتمد على سوق العمل في منطقتك. إذا كنت تستهدف الشركات الكبيرة، فغالباً React هو الخيار الأفضل. أما إذا كنت تريد بناء مشاريع سريعة، فـ Vue قد يكون أنسب."
          }
        ]
      },
      {
        "id": 5,
        "category": "language",
        "author": "عمر فاروق",
        "title": "تعلم اللغة الإنجليزية",
        "content": "ما هي أفضل الطرق لتطوير مهارة المحادثة باللغة الإنجليزية؟ أجيد القراءة والكتابة لكن المحادثة صعبة بالنسبة لي.",
        "comments": [
          {
            "author": "هدى أحمد",
            "content": "أنصحك بالانضمام إلى مجموعات محادثة على الإنترنت مثل Tandem أو HelloTalk، ومشاهدة المسلسلات الإنجليزية مع ترجمة إنجليزية."
          },
          {
            "author": "سامي وليد",
            "content": "جرب التحدث مع نفسك بصوت عالٍ عن يومك أو أفكارك باللغة الإنجليزية. ومن المفيد أيضًا تسجيل صوتك والاستماع إليه لتحسين النطق."
          }
        ]
      },
      {
        "id": 6,
        "category": "language",
        "author": "سارة نبيل",
        "title": "قواعد اللغة العربية",
        "content": "ما هي أكثر أخطاء الإعراب شيوعًا في اللغة العربية وكيف يمكن تجنبها؟",
        "comments": [
          {
            "author": "فارس سعيد",
            "content": "من أكثر الأخطاء شيوعًا الخلط بين حالات الرفع والنصب والجر للأسماء، وكذلك أخطاء في تصريف الأفعال. أنصح بقراءة الكتب والصحف الفصيحة بانتظام."
          },
          {
            "author": "لمياء كمال",
            "content": "التدريب المستمر على الإعراب هو المفتاح. هناك كتب مثل 'الإعراب الميسر' تساعد كثيرًا. أيضًا الاستماع إلى البرامج الفصيحة يعزز السليقة اللغوية."
          }
        ]
      },
      {
        "id": 7,
        "category": "science",
        "author": "خالد فهمي",
        "title": "نظرية النسبية آينشتاين",
        "content": "كيف يمكن تبسيط فهم نظرية النسبية العامة لشخص ليس لديه خلفية فيزيائية متقدمة؟",
        "comments": [
          {
            "author": "طارق سمير",
            "content": "يمكن تشبيه الزمكان بقطعة قماش مرنة، والأجسام الثقيلة مثل النجوم تحدث انحناءات في هذا القماش. الأجسام الأخرى تتحرك متبعة هذه الانحناءات وهو ما نسميه الجاذبية."
          },
          {
            "author": "ريم فؤاد",
            "content": "هناك كتب رائعة مبسطة مثل 'موجز تاريخ الزمن' لستيفن هوكينج. أيضًا قناة PBS Spacetime على يوتيوب تقدم شروحات مبسطة بالرسوم المتحركة."
          }
        ]
      },    
      {
        "id": 8,
        "category": "science",
        "author": "ياسمين صلاح",
        "title": "التغير المناخي",
        "content": "ما هي أهم الإجراءات التي يمكن للأفراد اتخاذها للمساهمة في مكافحة التغير المناخي؟",
        "comments": [
          {
            "author": "عادل رفيق",
            "content": "تقليل استهلاك اللحوم الحمراء، استخدام وسائل النقل العام بدلًا من السيارات الخاصة، وتقليل استهلاك الطاقة في المنزل من أهم الإجراءات الفردية."
          },
          {
            "author": "منى سالم",
            "content": "بالإضافة إلى ما ذكر، المشاركة في حملات التوعية ودعم السياسات البيئية مهم جدًا. التحول للطاقة المتجددة في المنزل مثل الألواح الشمسية له تأثير كبير أيضًا."
          }
        ]
      }
    ]
  }